# =============================================================================
# Homebrew Bundle File
# =============================================================================

# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Essential tools
brew "git"
brew "wget"
brew "curl"
brew "tree"
brew "htop"
brew "jq"
brew "fzf"

# Development
brew "postgresql@15"

brew "node"
brew "python@3.11"
brew "go"
brew "rust"

# Casks (GUI applications)
cask "visual-studio-code"
cask "docker"
cask "google-chrome"
cask "iterm2"
cask "postman"