# =============================================================================
# Homebrew Bundle File
# =============================================================================

# Taps
tap "hashicorp/tap"

# Essential tools
brew "wget"
brew "curl"
brew "tree"
brew "htop"
brew "jq"
brew "fzf"

# Development
brew "postgresql@15"
brew "node"
brew "openjdk"
brew "hashicorp/tap/terraform"

# Casks (GUI applications)
cask "visual-studio-code"
cask "docker-desktop"
cask "google-chrome"
cask "iterm2"
cask "postman"
cask "cursor"
